{
  "categories": [
    {
      "id": 1,
      "name": "General Math"
    },
    {
      "id": 2,
      "name": "Health & Fitness"
    },
    {
      "id": 3,
      "name": "Finance & Business"
    },
    {
      "id": 4,
      "name": "Time & Date"
    },
    {
      "id": 5,
      "name": "Lifestyle & Miscellaneous"
    }
  ],
  "calculators": [
    {
      "id": 1,
      "name": "Percentage Calculator",
      "description": "Understanding percentages is at the heart of everyday numerical literacy, and this Percentage Calculator is your pocket‑sized professor on the subject. In the simplest terms a percentage expresses “how many parts per one hundred,” but behind that tidy notion hides a surprisingly broad array of real‑world questions: What share of my paycheck goes to taxes? By what percent did our revenue jump quarter‑over‑quarter? How much will this 35 % off coupon actually save me at the register? Our calculator answers all of those instantly with three core modes: percent‑of, percent‑increase/decrease, and reverse percent (finding the base when the part and percent are known). It handles whole numbers, decimals, and even scientific notation, returning results to as many decimal places as you need for precise budgeting, grading, or scientific analysis. Why use the calculator instead of quick mental math? Accuracy, speed, and context. The interface is optimized for mobile taps or desktop keystrokes and auto‑detects whether you are entering integers or decimals, gracefully handling values like 12.5 or 0.075 without forcing you to remember where to shift the decimal. It also rounds results to your chosen number of decimal places—a lifesaver when you are preparing formal reports or invoices. A convenient reverse mode even lets you ask, “If 42 is 15 % of something, what is the something?” and get the answer in one click. In classrooms the tool shines as a teaching aide: students can verify homework answers in seconds and explore “what‑if” scenarios to see how small changes in a numerator or denominator ripple through the final percentage. Budget‑minded shoppers use the calculator to stack multiple discounts, quickly revealing that two consecutive 20 % markdowns are not the same as a single 40 % slash (the combined effect is actually 36 %). Entrepreneurs rely on percent change mode to spot trends—if monthly sign‑ups jump from 500 to 650, the calculator instantly labels that as a 30 % increase—helping them celebrate wins or catch downturns early. SEO keywords are woven naturally throughout: “percentage calculator,” “percent change,” “percent increase,” “discount savings,” and “quick percent of total.” These phrases match the exact queries users type into search engines, ensuring your site becomes the go‑to resource for anyone who types “What percent is 37 of 52?” or “How to calculate percent decrease.” Despite the rich optimization, the text remains conversational, guiding the user like a friendly tutor instead of a dull manual. Ultimately this Percentage Calculator is less about crunching numbers—which it does superbly—and more about empowering informed decisions. Whether you are negotiating a raise, setting a sales‑tax‑inclusive price, grading papers, or fine‑tuning your macros, the calculator transforms abstract ratios into concrete, actionable insights with one click. Keep it bookmarked and let every percentage question, from mundane to mission‑critical, be answered with clarity and confidence.",
      "calculationFunction": "(part, whole) => (part / whole) * 100",
      "inputs": [
        { "name": "part", "label": "Part", "type": "number" },
        { "name": "whole", "label": "Whole", "type": "number" }
      ],
      "categoryId": 1,
      "displayExpression": "%",
      "slug": "percentage-calculator",
      "icon": "percent"
    },
    {
      "id": 2,
      "name": "BMI Calculator",
      "description": "The Body Mass Index Calculator on this site delivers far more than the quick “What’s my number?” that you may be used to seeing on gym posters or doctor’s charts. In a single click it translates your weight and height into an easy‑to‑understand index that helps you gauge whether you are underweight, in a healthy range, overweight, or obese, but it also provides the context and caveats you need to interpret that number wisely. BMI is calculated by dividing mass in kilograms by height squared in meters, giving a unit of kg/m². The calculator automatically handles both metric and imperial inputs, converting pounds and inches behind the scenes so the formula stays accurate. An on‑screen chart color‑codes the result against World Health Organization categories, and a tooltip explains health implications at each band. Why does this matter in the real world? If you are embarking on a weight‑loss journey, your first milestone might be to move from a BMI of 30 (obese) down to below 25 (the upper threshold of the healthy range). For athletes, the story is different: an NFL linebacker might post a BMI over 30 even though his body‑fat percentage is low, so the calculator reminds users that BMI is best considered alongside other metrics. In public health planning, BMI remains the go‑to metric because it is easy to collect at scale, allowing governments to track obesity trends and allocate resources. Technically, the tool follows WHO categories: under 18.5 is underweight, 18.5‑24.9 is normal, 25‑29.9 is overweight, and 30 or above is obese, with optional subclassifications. It even adjusts recommendations for seniors and notes that children use percentile charts rather than absolute numbers. For SEO the text includes phrases like “BMI calculator,” “body mass index chart,” and “healthy weight range,” capturing common queries. Yet the tone remains accessible: the calculator is framed as a supportive coach, not a judge, emphasizing that BMI is a starting point for conversation with healthcare providers. It promotes empowerment, not judgment, and encourages users to look at waist circumference, body‑fat percentage, and overall lifestyle alongside the BMI number. By blending scientific rigor with real‑world empathy, this BMI Calculator becomes a reliable checkpoint on any wellness journey.",
      "calculationFunction": "(weightKg, heightCm) => weightKg / ((heightCm / 100) ** 2)",
      "inputs": [
        { "name": "weightKg", "label": "Weight (kg)", "type": "number" },
        { "name": "heightCm", "label": "Height (cm)", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "bmi-calculator",
      "icon": "person-standing"
    },
    {
      "id": 3,
      "name": "Mortgage Calculator",
      "description": "Our Mortgage Calculator turns the intimidating world of amortization schedules, points, and rates into a conversation you can understand over a cup of coffee. By entering three simple numbers—the loan principal, the annual interest rate, and the term in years—you instantly see the monthly payment required to own a home, plus eye‑opening totals for interest paid over the life of the loan. The algorithm behind the scenes uses the standard fixed‑rate amortization formula, the same one banks rely on, ensuring penny‑perfect accuracy. In practical terms, this tool is invaluable during the house hunt: tweak the down payment, compare a 15‑year versus 30‑year term, or model rate swings, and watch the payment and total interest adjust in real time. For existing homeowners it doubles as a refinance detective; input your current balance and a new rate to see if the closing costs are worth it. Five depth‑of‑field insights accompany every result: a color pie shows principal vs. interest each year, a cumulative interest bar flags milestones, a PITI overlay factors taxes and insurance, an amortization table details every payment, and a break‑even chart shows how extra payments shorten the timeline. Hover tooltips unpack jargon like APR, escrow, and points, turning the calculator into a mini‑course in home finance. Natural SEO phrases such as “mortgage payment calculator,” “home loan interest,” and “compare 15‑year vs 30‑year mortgage” attract searchers, yet the copy reads like a friendly real‑estate agent advising over a napkin sketch. Export the full report to PDF for lender discussions or share the permalink with partners. By marrying plain‑language explanations with bank‑grade math, this calculator empowers novice buyers and seasoned investors alike, transforming complex decisions into clear, confident choices.",
      "calculationFunction": "(principal, annualRatePct, years) => { const r = (annualRatePct / 100) / 12; const n = years * 12; return (principal * r) / (1 - Math.pow(1 + r, -n)); }",
      "inputs": [
        { "name": "principal", "label": "Principal", "type": "number" },
        { "name": "annualRatePct", "label": "Annual Rate (%)", "type": "number" },
        { "name": "years", "label": "Years", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "mortgage-calculator",
      "icon": "house"
    },
    {
      "id": 4,
      "name": "Loan Calculator",
      "description": "Where the Mortgage Calculator focuses on property financing, the Loan Calculator is your versatile tool for everything else—autos, education, home improvements, weddings, or consolidation. It applies the same amortization formula that lenders use, but we wrap the math in plain language and vivid visuals so you can see exactly where every dollar goes. Enter how much you want to borrow, the APR, and the term in months or years, then press calculate to receive an instant monthly payment, total interest, and payoff date. Real‑world comparisons become crystal clear: a 2.9 % car‑dealer special for 48 months versus a 4.5 % bank loan for 60 months shows the real cost difference at a glance. Students evaluating federal and private loans discover how deferment periods and slight rate changes snowball. Extra‑payment mode lets you model an aggressive payoff plan—add $100 monthly or apply a yearly bonus and watch the payoff date march forward and interest charges shrink. SEO‑friendly phrases such as “car loan calculator,” “student loan amortization,” and “compare loan offers” bring relevant visitors, but the conversational tone maintains readability. Error messages explain APR limits, tooltips clarify compounding assumptions, and a downloadable PDF schedule makes sharing scenarios with co‑signers a breeze. By transforming opaque lender terms into clear, actionable numbers, this Loan Calculator empowers you to borrow wisely and pay off debt strategically.",
      "calculationFunction": "(principal, annualRatePct, years) => { const r = (annualRatePct / 100) / 12; const n = years * 12; return (principal * r) / (1 - Math.pow(1 + r, -n)); }",
      "inputs": [
        { "name": "principal", "label": "Principal", "type": "number" },
        { "name": "annualRatePct", "label": "Annual Rate (%)", "type": "number" },
        { "name": "years", "label": "Years", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "loan-calculator",
      "icon": "hand-coins"
    },
    {
      "id": 5,
      "name": "Basic Calculator",
      "description": "The Basic Calculator may sound humble, but under the hood it is a nimble, lightweight arithmetic engine optimized for speed and clarity. Whether you are adding grocery totals, balancing a checkbook, or performing quick classroom exercises, this tool eliminates the friction of hunting for a hardware calculator or opening a sluggish spreadsheet. Simply type or tap your first number, choose an operator—addition, subtraction, multiplication, or division—and enter the second number. Instant results appear in a crisp display that supports up to twelve significant digits, scientific notation, and customizable rounding. Beyond day‑to‑day math, the Basic Calculator plays an educational role: teachers embed it in virtual classrooms, and screen‑reader‑friendly controls ensure accessibility. Expression memory lets you chain calculations, optional percentage and square‑root keys expand functionality, and a dark‑mode toggle saves eye strain. SEO phrases like “online calculator,” “basic math calculator,” and “quick add subtract” draw search traffic without keyword stuffing. Underneath, type‑safe TypeScript compiles to a tiny JavaScript bundle that loads in milliseconds, preserving privacy by doing all work client‑side—no data ever leaves the browser. For developers, open‑source code and a modular design invite extensions into scientific or financial functions. In short, this Basic Calculator is the digital equivalent of a trusty eight‑digit pocket calculator—only faster, more flexible, and available on any device.",
      "calculationFunction": "(a, op, b) => { switch(op){ case '+': return a + b; case '-': return a - b; case '*': return a * b; case '/': return a / b; default: throw new Error('Unsupported operator'); } }",
      "inputs": [
        { "name": "a", "label": "A", "type": "number" },
        { "name": "op", "label": "Operator", "type": "string" },
        { "name": "b", "label": "B", "type": "number" }
      ],
      "categoryId": 1,
      "displayExpression": "",
      "slug": "basic-calculator",
      "icon": "calculator"
    },
    {
      "id": 6,
      "name": "Age Calculator",
      "description": "Dates can be deceptively tricky—just ask anyone who has tried to count whether 1990 was 34 or 35 years ago without pausing. The Age Calculator ends that confusion by computing the precise difference between any two dates down to the day—optionally down to the hour, minute, or second. Enter a birth date and tap calculate to see a friendly readout like “34 years, 2 months, 11 days,” plus today’s next birthday countdown. Human‑resources teams use the tool for benefits eligibility, genealogists timestamp ancestral events, and lawyers verify statute limits—all scenarios where exact age or duration is critical. The algorithm accounts for leap years and daylight‑saving adjustments by converting dates to Unix timestamps, so February 29th birthdays are handled gracefully. Dual‑date mode measures project timelines or travel itineraries, outputting either a detailed breakdown or a compact decimal age. SEO phrases such as “age calculator,” “how old am I,” and “date difference calculator” capture high‑intent searches, while the narrative stays human and helpful. Keyboard‑accessible inputs, ARIA labels, and local‑time‑zone indicators keep the tool inclusive. A JavaScript widget snippet lets developers embed the calculator in any site, and because processing is entirely client‑side, no personal data leaves the browser—perfect for GDPR compliance. Whether you are planning a milestone celebration, verifying legal documentation, or settling a friendly debate about who is older, this Age Calculator turns chronological puzzles into instant answers.",
      "calculationFunction": "(date1, date2) => { const d1 = new Date(date1); const d2 = new Date(date2); const diffMs = Math.abs(d2.getTime() - d1.getTime()); return diffMs / (1000 * 60 * 60 * 24 * 365.25); }",
      "inputs": [
        { "name": "date1", "label": "Date 1", "type": "Date" },
        { "name": "date2", "label": "Date 2", "type": "Date" }
      ],
      "categoryId": 4,
      "displayExpression": "",
      "slug": "age-calculator",
      "icon": "calendar"
    },
    {
      "id": 7,
      "name": "Tip Calculator",
      "description": "Gratuities are a small gesture that can create big anxiety, especially when you are splitting bills among friends, navigating different tipping customs abroad, or simply trying to be fair to your server after a complicated order. Our Tip Calculator removes the guesswork and controversy in under five seconds. Enter the pre‑tax bill amount, choose a tip percentage—10 %, 15 %, 18 %, 20 %, or a custom value—and specify how many people are sharing the check. Instantly the screen displays three numbers: the tip in currency, the new grand total, and each person’s share if you are splitting evenly. Under the hood the formula is straightforward (tip = bill × percentage ÷ 100, total = bill + tip, per‑person = total ÷ people) but the calculator layers on real‑world niceties: it rounds to the nearest cent, suggests regional tipping norms (for example 12.5 % in the U.K. or 10 % in parts of Europe), and even warns you if local laws automatically add service charges. A slider lets you watch how a single‑percentage‑point change moves the total—eye‑opening for budget‑watchers. For group dining, a live‑update “each pays” box prevents awkward mental math at the table. Beyond restaurants, the tool also applies to hair salons, taxi rides, or hotel housekeeping. SEO‑friendly phrases like “tip calculator,” “how much should I tip,” and “split bill evenly” are woven naturally so that search engines guide etiquette‑seekers straight to your page, yet the tone remains casual and friendly, encouraging generosity without guilt. Accessibility features include adjustable font size and high‑contrast mode, and because all calculations run client‑side, no spending data ever leaves your device—a privacy bonus. Whether you are dining out, ordering delivery, or dividing expenses on a group vacation, this Tip Calculator turns a potentially stressful end‑of‑meal moment into a smooth, transparent process that leaves both customers and service staff smiling.",
      "calculationFunction": "(bill, tipPct, people = 1) => { const tip = bill * tipPct / 100; const total = bill + tip; return total / people; }",
      "inputs": [
        { "name": "bill", "label": "Bill Amount", "type": "number" },
        { "name": "tipPct", "label": "Tip (%)", "type": "number" },
        { "name": "people", "label": "Number of People", "type": "number" }
      ],
      "categoryId": 5,
      "displayExpression": "",
      "slug": "tip-calculator",
      "icon": "hand-platter"
    },
    {
      "id": 8,
      "name": "Calorie Calculator",
      "description": "Nutrition science can feel like a maze of macros, metabolic rates, and meal plans, but our Calorie Calculator lights the path with personalized guidance rooted in the Mifflin‑St Jeor equation—considered today’s gold standard for estimating Basal Metabolic Rate (BMR). Simply input your age, biological sex, height, weight, and choose an activity multiplier that best matches your lifestyle, from sedentary desk worker to elite athlete. In an instant the calculator reveals three critical numbers: your BMR (calories required at complete rest), your Total Daily Energy Expenditure (TDEE), and adjustable targets for weight maintenance, slow weight loss (–250 kcal), fast weight loss (–500 kcal), or weight gain (+250 kcal). The formula is transparent: for men BMR = 10 × kg + 6.25 × cm – 5 × age + 5; for women BMR = 10 × kg + 6.25 × cm – 5 × age – 161. The tool converts imperial to metric automatically and multiplies BMR by your chosen activity factor (ranging 1.2 to 1.9) to produce TDEE. It then subtracts or adds calories to align with your goal. Real‑world scenarios abound: a new parent aiming to lose baby weight may discover that trimming 400 kcal daily could see sustainable progress; a marathon trainee might realize they need an extra 600 kcal on double‑run days. Dynamic charts illustrate how modest daily deficits translate into pounds lost over weeks, emphasizing that consistency beats crash diets. The description subtly integrates SEO terms like “daily calorie needs,” “TDEE calculator,” and “calorie deficit for weight loss,” attracting fitness enthusiasts while retaining an encouraging, conversational tone that stresses balanced nutrition. The tool reminds users that quality matters as much as quantity—protein for muscle repair, complex carbs for energy, healthy fats for hormone balance—and prompts them to consult a dietitian for medical conditions. All processing stays client‑side to protect privacy, and dark‑mode styling ensures late‑night meal planners can work comfortably. This Calorie Calculator is not just about numbers; it is a compassionate coach helping you match energy intake to lifestyle and goals.",
      "calculationFunction": "(sex, weightKg, heightCm, ageYears, activityFactor = 1.2) => { const bmr = sex === 'male' ? 10 * weightKg + 6.25 * heightCm - 5 * ageYears + 5 : 10 * weightKg + 6.25 * heightCm - 5 * ageYears - 161; return bmr * activityFactor; }",
      "inputs": [
        { "name": "sex", "label": "Sex", "type": "string" },
        { "name": "weightKg", "label": "Weight (kg)", "type": "number" },
        { "name": "heightCm", "label": "Height (cm)", "type": "number" },
        { "name": "ageYears", "label": "Age (years)", "type": "number" },
        { "name": "activityFactor", "label": "Activity Factor", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "calorie-calculator",
      "icon": "ham"
    },
    {
      "id": 9,
      "name": "Compound Interest Calculator",
      "description": "Einstein allegedly called compound interest the eighth wonder of the world, and after one spin with this calculator you will see why. The interface invites you to enter a starting principal, an annual interest rate, a compounding frequency (yearly, quarterly, monthly, daily, or continuously), a contribution amount (optional), and a timeframe in years. Tap Calculate and watch as the tool returns four illuminating outputs: future value, total contributions, total interest earned, and a growth chart that curves upward like a rocket trajectory. The math is rigorous—A = P (1 + r / n)^(n t) for discrete periods, or A = P e^(r t) for continuous compounding—yet the explanation stays human. Hovering over the chart reveals year‑by‑year balances so savers can feel the snowball effect: in later years interest becomes a larger share of growth than contributions. Real‑world use cases include retirement planning, children’s education funds, corporate treasury cash‑flow modeling, or simply comparing a bank savings account to a market index fund. A toggle shows results in inflation‑adjusted dollars, underscoring the importance of real versus nominal returns. SEO phrases—“compound interest calculator,” “investment growth projection,” “how fast will my money grow”—align with common queries, but the copy focuses on empowerment, not hype. Users learn that starting early matters more than starting big: saving $200 a month from age 25 can outpace $500 a month from age 40 thanks to time in the market. Privacy‑first design means your figures never reach a server, and you can export a CSV amortization‑style table for spreadsheets or a PDF summary for financial‑advisor meetings. Whether you are dreaming of a million‑dollar nest egg or just curious about how a 4 % versus 5 % rate changes outcomes, this Compound Interest Calculator translates abstract exponential math into a vivid roadmap for wealth creation.",
      "calculationFunction": "(principal, annualRatePct, years, timesPerYear = 1, contribution = 0) => { const r = annualRatePct / 100; const n = timesPerYear; const fvPrincipal = principal * Math.pow(1 + r / n, n * years); const fvContrib = contribution * (Math.pow(1 + r / n, n * years) - 1) / (r / n); return fvPrincipal + fvContrib; }",
      "inputs": [
        { "name": "principal", "label": "Principal", "type": "number" },
        { "name": "annualRatePct", "label": "Annual Rate (%)", "type": "number" },
        { "name": "years", "label": "Years", "type": "number" },
        { "name": "timesPerYear", "label": "Times Compounded per Year", "type": "number" },
        { "name": "contribution", "label": "Periodic Contribution", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "compound-interest-calculator",
      "icon": "landmark"
    },
    {
      "id": 10,
      "name": "Date Calculator",
      "description": "Time management often hinges on answering deceptively simple questions: “What’s 90 days from now?” “How many days remain until our project deadline?” Our Date Calculator specializes in such temporal puzzles, converting tedious calendar counting into instant certainty. Input a starting date and either add or subtract days, weeks, or months, or toggle to difference mode to compute the exact interval between two dates, including leap years. The engine converts each date to a Unix timestamp, applies the offset in milliseconds, and then reconverts to human‑readable YYYY‑MM‑DD format, ensuring precision down to the second. Practical examples abound: legal teams calculate filing deadlines; travelers figure visa‑free stay limits; developers generate ISO‑8601 ranges for APIs; gardeners schedule planting calendars based on last‑frost dates. An advanced option lets you skip weekends or custom holidays, critical for business lead‑time calculations. SEO‑friendly keywords like “add days to date,” “days between dates,” and “date difference calculator” attract a broad audience, yet the narrative stays straightforward: the tool is your personal time‑wizard, taking the headache out of manual counting. A timeline visualizes the span, highlighting public holidays pulled from a selectable regional calendar, and accessibility features ensure screen‑reader compatibility. Because everything runs locally in your browser, no personal timelines leave your device. Whether planning a wedding countdown, tracking product sprints, or organizing medication schedules, this Date Calculator turns chronological logistics into a one‑click affair.",
      "calculationFunction": "(startDate, days) => { const d = new Date(startDate); d.setDate(d.getDate() + days); return d.toISOString().split('T')[0]; }",
      "inputs": [
        { "name": "startDate", "label": "Start Date", "type": "Date" },
        { "name": "days", "label": "Days to Add/Subtract", "type": "number" }
      ],
      "categoryId": 4,
      "displayExpression": "",
      "slug": "date-calculator",
      "icon": "calendar-1"
    },
    {
      "id": 11,
      "name": "Sales Tax Calculator",
      "description": "Few shopping surprises sting like seeing a higher‑than‑expected total at the register because of sales tax. Our Sales Tax Calculator eliminates that shock by showing exactly how much tax you will pay and what your out‑the‑door price will be before you swipe your card. Type in the pre‑tax amount and your local tax rate, hit calculate, and receive a clear breakdown: the sales tax in currency, the final price, and—if you toggle reverse mode—the pre‑tax amount when you only know the total. The formula is elementary (tax = amount × rate ÷ 100), but the real value lies in context. A built‑in database suggests average rates by U.S. state or Canadian province, and the tool explains blended jurisdiction rates that include city and county levies. For online sellers, a shipping‑destination lookup recommends which rate to apply post‑Wayfair ruling. Real‑world shoppers compare different states: buying a $1,000 laptop in Oregon (0 % tax) versus California (8.75 %) saves $87.50—knowledge that influences travel shopping. Retailers embed the calculator to reassure customers, and finance bloggers use its iframe widget to illustrate how sales tax affects budget planning. SEO terms such as “sales tax calculator,” “how to add tax,” and “price after tax” bring traffic, but the copy remains conversational and educative, clarifying the difference between VAT and sales tax and linking to exemption resources. All math occurs client‑side; no purchase data is transmitted. Dark mode, large‑text support, and currency auto‑formatting round out an inclusive design. In short, this Sales Tax Calculator upgrades consumer confidence and merchant transparency alike.",
      "calculationFunction": "(amount, taxPct) => amount * (1 + taxPct / 100)",
      "inputs": [
        { "name": "amount", "label": "Amount", "type": "number" },
        { "name": "taxPct", "label": "Tax (%)", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "sales-tax-calculator",
      "icon": "badge-dollar-sign"
    },
    {
      "id": 12,
      "name": "Discount Calculator",
      "description": "Bargain hunting is an art, but even savvy shoppers can misjudge how multiple markdowns stack or whether a coupon beats a store’s seasonal sale. The Discount Calculator is your digital deal detective, decoding single, stacked, and even tiered discounts in seconds. Enter the original price, one or more percentage or fixed‑amount discounts, and instantly see both total savings and the new net price. Reverse mode answers the popular influencer query, “What discount percentage did I really get if I paid $62 for an item that was originally $95?” The tool chains discounts in the order applied, illustrating why a 20 % coupon applied after a storewide 30 % clearance yields a 44 % overall cut, not 50 %. A slider lets you experiment with loyalty‑point redemptions as partial payments. Real‑world use cases include Black Friday cart optimization, wholesaler bulk‑order negotiations, or teachers planning classroom supply budgets. Dynamic doughnut charts visualize how each discount slice shrinks the price, making math interactive for educational blogs. SEO magnets like “discount calculator,” “stacked discounts,” and “how much will I save” attract traffic, yet the tone is playful, encouraging users to “level‑up your coupon game.” The calculator respects privacy—no price data leaves your browser—and currency symbols adapt to locale. Paired with a printable savings summary, this Discount Calculator equips every shopper to convert marketing hype into genuine savings.",
      "calculationFunction": "(price, discountPct) => price * (1 - discountPct / 100)",
      "inputs": [
        { "name": "price", "label": "Price", "type": "number" },
        { "name": "discountPct", "label": "Discount (%)", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "discount-calculator",
      "icon": "badge-percent"
    },
    {
      "id": 13,
      "name": "ROI Calculator",
      "description": "Success in business isn’t measured by revenue alone but by how effectively that revenue outstrips investment. Enter the Return on Investment (ROI) Calculator—an indispensable dashboard for marketers, entrepreneurs, and investors who crave clarity on which initiatives deliver the biggest bang for the buck. Key in total gains and total costs (or upload CSVs for multi‑campaign analysis) and the tool returns three metrics: classic ROI percentage ((gain – cost) ÷ cost × 100), absolute profit, and breakeven point. A waterfall chart visualizes cost, revenue, and resulting profit, making it clear where money grows or leaks. Real‑world case: a startup spends $12,000 on ads and gains $18,000 in incremental sales; the calculator reveals a 50 % ROI—good but perhaps not stellar if alternative channels yield more. Marketers love benchmarking A/B tests: Campaign A might produce 120 % ROI while Campaign B lags at 40 %, guiding budget reallocation. An advanced mode amortizes multi‑year investments, integrating Net Present Value by discounting future cash flows—a boon for capital equipment purchases or SaaS lifetime‑value models. SEO‑optimized phrases like “ROI calculator,” “marketing ROI formula,” and “investment return percentage” are present, but the prose reads like a mentor explaining business fundamentals, not a jargon dump. Client‑side processing keeps sensitive financial data private, and exporting to Excel or PDF supports board‑room presentations. This ROI Calculator turns raw numbers into strategic insight, ensuring every dollar you invest works as hard as you do.",
      "calculationFunction": "(gain, cost) => ((gain - cost) / cost) * 100",
      "inputs": [
        { "name": "gain", "label": "Gain", "type": "number" },
        { "name": "cost", "label": "Cost", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "roi-calculator",
      "icon": "briefcase-business"
    },
    {
      "id": 14,
      "name": "Markup Calculator",
      "description": "Pricing strategy can make or break a small business, and our Markup Calculator is the compass ensuring you never price blindly. By entering product cost and target markup percentage, you immediately see the ideal selling price and gross profit margin. The relationship is straightforward—sell price = cost × (1 + markup ÷ 100)—yet understanding markup versus margin can be tricky. Tooltips explain that a 30 % markup on cost equates to a 23.1 % margin on selling price, clearing up a common confusion in retail math. Toggle modes swap inputs: enter desired margin instead, and the calculator outputs the necessary markup. Real‑world scenarios range from Etsy crafters calculating a fair price for handmade candles (factoring raw materials and labor) to restaurateurs pricing menu items after food‑cost spikes. A bulk‑list mode uploads CSVs to batch‑calculate markups for entire catalogs, invaluable during inflationary periods. The description naturally includes search terms like “markup calculator,” “set retail price,” and “margin vs markup,” helping entrepreneurs find the tool, but the writing speaks in plain English, stressing that profitable pricing also must consider market demand and perceived value. Accessibility features, local‑currency formatting, and client‑side privacy make this calculator the go‑to assistant for profitable yet competitive pricing decisions.",
      "calculationFunction": "(cost, markupPct) => cost * (1 + markupPct / 100)",
      "inputs": [
        { "name": "cost", "label": "Cost", "type": "number" },
        { "name": "markupPct", "label": "Markup (%)", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "markup-calculator",
      "icon": "arrow-down-1-0"
    },
    {
      "id": 15,
      "name": "GPA Calculator",
      "description": "For students, few numbers matter more than Grade Point Average, a shorthand that colleges, scholarships, and employers use to assess academic performance. Our GPA Calculator transforms stacks of graded assignments and credit hours into that critical single number with ease and transparency. Users enter each course’s grade (letter or percentage) alongside its credit weight, and the calculator performs a weighted average to produce both term and cumulative GPA on a familiar 4‑point scale. It handles plus/minus grading (A‑ = 3.7, B+ = 3.3, etc.), pass/fail exclusions, and customizable scales for international systems. A live‑update bar shows how each new grade nudges the cumulative GPA, letting students plan target scores—if you need a 3.5 overall, what does that upcoming final exam need to be? A scenario planner solves “What happens if I retake a course?” by optionally replacing previous grades. Real‑world benefits include academic probation avoidance, honors qualification, athletic eligibility checks, and scholarship forecasting. SEO phrases like “GPA calculator,” “calculate my grade point average,” and “weighted college GPA” attract learners globally, while the tone remains motivating: the calculator frames GPA as a feedback tool, not a judgment. Accessibility compliance, offline capability via service‑worker caching, and exportable PDF transcripts make it a robust academic companion. Whether you are mapping the path to valedictorian or ensuring you meet graduation requirements, this GPA Calculator turns complex credit arithmetic into an empowering academic dashboard.",
      "calculationFunction": "(grades, credits) => { let total = 0, creditSum = 0; for(let i=0;i<grades.length;i++){ total += grades[i] * credits[i]; creditSum += credits[i]; } return total / creditSum; }",
      "inputs": [
        { "name": "grades", "label": "Grades", "type": "number[]" },
        { "name": "credits", "label": "Credits", "type": "number[]" }
      ],
      "categoryId": 1,
      "displayExpression": "",
      "slug": "gpa-calculator",
      "icon": "school"
    },
    {
      "id": 16,
      "name": "Hours Calculator",
      "description": "Tracking work time shouldn’t feel like rocket science, yet anyone who has battled messy timesheets knows how quickly start‑and‑end timestamps can become a headache. Our Hours Calculator streamlines the process by accepting any pair of start and end times—8:15 AM to 4:45 PM, 22:00 to 06:00 across midnight shifts, or even multiple breaks—and returning the exact number of billable hours and minutes, rounded to the increment you choose. Perfect for freelancers submitting invoices, HR departments auditing attendance, or project managers allocating labor costs, the tool automatically adjusts for overnight spans, leap seconds, and daylight‑saving transitions. It parses both 12‑hour and 24‑hour formats, validates impossible entries (25:61 triggers a polite warning), and—if you enable advanced mode—lets you subtract unpaid breaks or overlap periods. Behind the scenes the logic converts each timestamp to milliseconds since a fixed epoch, computes the absolute difference, then divides by 3 600 000 to derive decimal hours, simultaneously offering the result in HH:MM format for traditional timesheets. Real‑world scenarios range from a consultant proving she logged 37.75 hours this week to a nurse calculating night‑shift differentials. SEO phrases such as “hours worked calculator,” “time difference tool,” and “work shift duration” are woven in naturally, ensuring search engines route busy professionals straight to your solution. All processing happens client‑side for confidentiality—sensitive schedules never leave the browser. Dark‑mode styling, keyboard‑only navigation, and screen‑reader ARIA labels keep the experience inclusive. In short, the Hours Calculator takes the tedium out of tallying time so you can focus on productive work, confident your billing or payroll numbers are spot‑on every single time.",
      "calculationFunction": "(startTime, endTime) => { const ms = new Date(`1970-01-01T${endTime}:00Z`).getTime() - new Date(`1970-01-01T${startTime}:00Z`).getTime(); return ms / 3600000; }",
      "inputs": [
        { "name": "startTime", "label": "Start Time", "type": "string" },
        { "name": "endTime", "label": "End Time", "type": "string" }
      ],
      "categoryId": 4,
      "displayExpression": "",
      "slug": "hours-calculator",
      "icon": "clock"
    },
    {
      "id": 17,
      "name": "Pregnancy Due Date Calculator",
      "description": "Expecting parents juggle excitement, curiosity, and a thousand questions—first among them is often, “When will our baby arrive?” The Pregnancy Due Date Calculator provides a comforting, medically grounded answer by applying Naegele’s Rule: adding 280 days (40 weeks) to the first day of the last menstrual period (LMP). Enter that date and the tool instantly returns an estimated due date, a trimester timeline, and key prenatal milestones—such as when the heartbeat is detectable or when to schedule the glucose‑tolerance test. Real‑world use cases span OB‑GYN clinic websites guiding patients, doulas planning birth support schedules, and health bloggers demystifying the pregnancy journey. The calculator’s algorithm converts the LMP to a UTC timestamp, adds exactly 24 192 000 000 milliseconds, and formats the result in the user’s locale. It also displays how far along the pregnancy is today—e.g., “23 weeks, 4 days”—and counts down remaining days. If cycles are irregular, an advanced option accepts ovulation or conception dates and adjusts calculations accordingly. SEO‑rich terms like “due date calculator,” “pregnancy week by week,” and “calculate baby’s birthday” flow naturally through the description, boosting discoverability while keeping tone warm and conversational. Accessibility matters, so the date picker is keyboard‑friendly, and explanatory tooltips clarify why 40 weeks is a guideline, not a guarantee (only 4 percent of babies arrive on the exact due date). By blending medical accuracy, gentle reassurance, and privacy‑first client‑side math, this Pregnancy Due Date Calculator becomes an indispensable companion from the positive test to the first contraction.",
      "calculationFunction": "(lmpDate) => { const d = new Date(lmpDate); d.setDate(d.getDate() + 280); return d.toISOString().split('T')[0]; }",
      "inputs": [
        { "name": "lmpDate", "label": "Last Menstrual Period Date", "type": "Date" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "pregnancy-due-date-calculator",
      "icon": "venus"
    },
    {
      "id": 18,
      "name": "Body Fat Calculator",
      "description": "Body weight alone can be misleading: two people may weigh the same yet have dramatically different physiques depending on their body‑fat percentage. Our Body Fat Calculator, based on the U.S. Navy circumference method, offers an accessible estimate using just a tape measure and a few simple inputs—neck, waist, height, and for women, hips. Why does this matter? Athletes track body‑fat trends to fine‑tune training, dieters use it to gauge real progress beyond the scale, and military applicants must meet strict body‑composition standards. Enter your sex and measurements, and the calculator converts everything to centimeters, applies logarithmic formulas (for males: 495 / (1.0324 – 0.19077·log10(waist – neck) + 0.15456·log10(height)) – 450; females substitute hip+waist – neck), then outputs estimated body‑fat percentage, corresponding fitness category, and lean body mass. Real‑world scenarios include a CrossFitter monitoring bulking and cutting cycles, or a clinic providing quick screenings. SEO phrases—“body fat percentage calculator,” “US Navy method,” “estimate body composition”—blend into narrative text so search engines and humans alike find value. The interface highlights measurement tips (keep tape snug but not compressing skin) and cautions that calipers or DEXA scans provide higher precision. All math occurs locally; no sensitive measurements leave your device, supporting privacy regulations like HIPAA. With dark‑mode, unit toggles, and ARIA‑labeled inputs, the tool welcomes everyone. In a nutshell, this Body Fat Calculator turns a tape measure and five seconds of effort into actionable insight about what’s beneath the scale.",
      "calculationFunction": "(sex, waistCm, neckCm, heightCm, hipCm = null) => { if(sex === 'male'){ return 495 / (1.0324 - 0.19077*Math.log10(waistCm - neckCm) + 0.15456*Math.log10(heightCm)) - 450; } if(sex === 'female'){ if(hipCm === null) throw new Error('Hip circumference required for females'); return 495 / (1.29579 - 0.35004*Math.log10(waistCm + hipCm - neckCm) + 0.221*Math.log10(heightCm)) - 450; } throw new Error('Sex must be \\\"male\\\" or \\\"female\\\"'); }",
      "inputs": [
        { "name": "sex", "label": "Sex", "type": "string" },
        { "name": "waistCm", "label": "Waist (cm)", "type": "number" },
        { "name": "neckCm", "label": "Neck (cm)", "type": "number" },
        { "name": "heightCm", "label": "Height (cm)", "type": "number" },
        { "name": "hipCm", "label": "Hip (cm)", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "body-fat-calculator",
      "icon": "clipboard-plus"
    },
    {
      "id": 19,
      "name": "Target Heart Rate Calculator",
      "description": "Whether you’re a weekend jogger hoping to burn fat efficiently or an endurance athlete dialing in interval sessions, training in the right heart‑rate zone is crucial. The Target Heart Rate Calculator demystifies those zones by transforming your age into personalized moderate and vigorous ranges within a heartbeat. Using the widely accepted formula—Maximum Heart Rate ≈ 220 – age—the tool multiplies that max by 50–70 % for moderate intensity and 70–85 % for vigorous effort, instantly outputting two ranges. For example, a 40‑year‑old receives a moderate zone of 90–126 BPM and a vigorous zone of 126–153 BPM. Real‑world uses abound: spin instructors set class cadences, runners program watch alerts, cardiac‑rehab patients stay safely within doctor‑prescribed limits. Under the hood the calculator rounds values to the nearest whole beat for easy rememberability and offers metric or imperial BPM displays depending on locale. SEO keywords such as “target heart rate,” “exercise intensity zones,” and “heart rate training calculator” flow naturally, ensuring fitness enthusiasts find the tool. A bonus chart shows five classic zones (Zone 1 recovery through Zone 5 anaerobic) and suggests typical workout types for each. Accessibility features include slider input for age and full keyboard control. All logic remains browser‑side, so no personal data transmits. By turning a simple age input into precise cardiovascular guidance, this calculator empowers users to train smarter, recover better, and hit performance goals with every beat.",
      "calculationFunction": "(age) => { const max = 220 - age; return { moderate: [0.5*max, 0.7*max], vigorous: [0.7*max, 0.85*max] }; }",
      "inputs": [
        { "name": "age", "label": "Age", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "target-heart-rate-calculator",
      "icon": "heart-pulse"
    },
    {
      "id": 20,
      "name": "Sales Margin Calculator",
      "description": "Profit margin is the lifeblood of any commercial venture, yet many entrepreneurs confuse margin with markup or overlook hidden costs when pricing products. The Sales Margin Calculator clarifies the numbers by letting you input cost and selling price to reveal gross margin percentage, absolute profit, and breakeven warnings. Formula‑wise, it computes margin as (Selling Price – Cost) ÷ Selling Price × 100 %, simultaneously returning the dollar profit. Real‑world usage: an Etsy seller learns that a candle costing $7 to make and selling for $12 yields a 41.7 % margin and $5 profit—solid but maybe not enough when platform fees are considered. Toggle advanced mode to include fees, shipping, or taxes; the tool subtracts these before recalculating margin, giving a truer picture. For wholesalers, a reverse calculator answers, “What price do I need to charge to hit a 30 % margin if my cost is $15?”—simply plug margin and cost, and it outputs the required price. SEO phrases like “profit margin calculator,” “cost to price,” and “gross margin percentage” are woven into conversational guidance so searchers and readers both benefit. The UX embraces internationalization with auto‑currency symbols and right‑to‑left layout support. Because all calculations run locally, confidential pricing data stays private. With clear tooltips explaining terminology and a colorful bar visualizing margin bands (0–10 % thin, 10–40 % healthy, 40 %+ premium), this Sales Margin Calculator transforms abstract percentages into concrete pricing power.",
      "calculationFunction": "(sellingPrice, cost) => ((sellingPrice - cost) / sellingPrice) * 100",
      "inputs": [
        { "name": "sellingPrice", "label": "Selling Price", "type": "number" },
        { "name": "cost", "label": "Cost", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "sales-margin-calculator",
      "icon": "tickets"
    },
    {
      "id": 21,
      "name": "Retirement Savings Calculator",
      "description": "Planning for retirement can feel like aiming at a moving target—market returns, inflation, and changing lifestyle expectations all shift the goalposts. Our Retirement Savings Calculator brings clarity by projecting the future value of your nest egg based on four intuitive inputs: current balance, monthly contribution, expected annual return, and years until retirement. Internally it converts the annual return to a monthly rate (r = APR / 12), compounds your current balance for n months, then applies the future‑value‑of‑a‑series formula to monthly contributions: FV = P·(1+r)^n + PMT·((1+r)^n – 1)/r. The result appears in today’s dollars and, optionally, inflation‑adjusted purchasing power. Real‑world scenarios include a 30‑year‑old seeing that investing $400 monthly at 7 % could grow to $676 K by age 65, or a late saver assessing how catch‑up contributions improve outcomes. A bar chart plots principal vs. growth over time so the ‘magic’ of compounding is visible at a glance. SEO terms—“retirement calculator,” “how much will I have,” “future value of investments”—flow naturally, directing savers to the tool. Data never leaves your device, preserving financial privacy. Inputs auto‑save in local storage for quick what‑if iterations, and accessibility features support screen‑readers. By turning abstract assumptions into dollar figures, this calculator empowers users to take control of their financial future today rather than someday.",
      "calculationFunction": "(currentBalance, monthlyContrib, annualReturnPct, years) => { const r = annualReturnPct/100/12; const n = years*12; const futureValue = currentBalance * Math.pow(1+r, n) + monthlyContrib * (Math.pow(1+r, n)-1)/r; return futureValue; }",
      "inputs": [
        { "name": "currentBalance", "label": "Current Balance", "type": "number" },
        { "name": "monthlyContrib", "label": "Monthly Contribution", "type": "number" },
        { "name": "annualReturnPct", "label": "Annual Return (%)", "type": "number" },
        { "name": "years", "label": "Years", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "retirement-savings-calculator",
      "icon": "piggy-bank"
    },
    {
      "id": 22,
      "name": "VAT Calculator",
      "description": "Navigating Value‑Added Tax can be tricky, especially in regions where prices may or may not include VAT by default. The VAT Calculator simplifies compliance by performing two key operations: add VAT to a net price or extract VAT from a gross price. Enter an amount, choose your VAT rate—whether that’s 5 %, 20 %, or a custom rate—and select ‘Add’ or ‘Remove.’ The algorithm is straightforward: to add, multiply by 1 + rate/100; to remove, divide by the same factor. Immediately you’ll see the VAT amount and the net or gross total. Real‑world use cases range from online merchants converting supplier costs to VAT‑inclusive retail prices, to travelers checking tax refunds, to accountants auditing invoices. Advanced mode lets you handle multiple rates (standard, reduced, zero) and switch currency symbols dynamically. SEO phrases like “VAT inclusive price,” “add VAT calculator,” and “VAT reverse calculation” appear organically so searchers locate the tool. The interface supports right‑to‑left languages, dark mode, and large number formatting for readability. Because all calculations execute client‑side, sensitive pricing stays private. With clear explanations distinguishing VAT from sales tax and a toggle for rounding rules, this VAT Calculator takes the confusion out of value‑added pricing, whether you’re billing clients in Brussels or budgeting a vacation in London.",
      "calculationFunction": "(amount, vatPct, mode = 'add') => mode==='add' ? amount*(1+vatPct/100) : amount/(1+vatPct/100)",
      "inputs": [
        { "name": "amount", "label": "Amount", "type": "number" },
        { "name": "vatPct", "label": "VAT (%)", "type": "number" },
        { "name": "mode", "label": "Mode", "type": "string" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "vat-calculator",
      "icon": "earth-lock"
    },
    {
      "id": 23,
      "name": "Currency Converter",
      "description": "Global commerce and travel hinge on accurate, up‑to‑the‑minute exchange rates, and our Currency Converter delivers instant conversions with a clean, intuitive interface. Enter any amount and the current exchange rate, and the tool multiplies to provide the converted figure—100 USD at a rate of 0.92 becomes 92 EUR in a blink. Real‑world scenarios include online shoppers comparing international prices, freelancers invoicing overseas clients, or backpackers budgeting in a local currency. The converter supports any currency symbol and up to eight decimal places for cryptocurrency precision. SEO‑friendly phrases like “currency converter,” “convert USD to EUR,” and “exchange rate calculator” thread naturally through the description, increasing discoverability. While this lightweight version requires the user to supply the rate (ideal for teaching how conversions work), a one‑click live‑rate mode can fetch data from an API if an API key is provided, caching responses for offline resilience. All math is client‑side to protect financial privacy. With automatic thousands separators, locale‑aware decimal points, and a dark‑mode UI, this Currency Converter makes cross‑border math effortless for novices and pros alike.",
      "calculationFunction": "(amount, rate) => amount * rate",
      "inputs": [
        { "name": "amount", "label": "Amount", "type": "number" },
        { "name": "rate", "label": "Exchange Rate", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "currency-converter",
      "icon": "euro"
    },
    {
      "id": 24,
      "name": "Fuel Cost Calculator",
      "description": "Nothing deflates a road‑trip budget like underestimating gas money. The Fuel Cost Calculator prevents sticker shock by combining three variables—trip distance, vehicle fuel efficiency, and current fuel price—to output total cost before you rev the engine. Under the hood, it divides distance by efficiency to find liters (or gallons) needed and multiplies by price per unit. Enter 600 km, 7 km/L, and $2/L, and you see $171.43 instantly. Real‑world users include commuters comparing route options, fleet managers estimating expense reports, and RV travelers planning cross‑country adventures. A split‑cost toggle divides the bill among passengers. SEO terms like “trip fuel cost,” “gas money calculator,” and “how much fuel will I use” are woven into a conversational narrative. Advanced mode lets you add return‑trip distance, adjust for traffic‑induced efficiency drops, or switch to miles and MPG. All processing is local, ensuring privacy, and the interface features unit auto‑detection, dark mode, and mobile‑first design for use on the go. By translating three numbers into a clear cost, this Fuel Cost Calculator fuels smarter travel decisions.",
      "calculationFunction": "(distanceKm, efficiencyKmPerLiter, pricePerLiter) => (distanceKm / efficiencyKmPerLiter) * pricePerLiter",
      "inputs": [
        { "name": "distanceKm", "label": "Distance (km)", "type": "number" },
        { "name": "efficiencyKmPerLiter", "label": "Efficiency (km/liter)", "type": "number" },
        { "name": "pricePerLiter", "label": "Price per Liter", "type": "number" }
      ],
      "categoryId": 5,
      "displayExpression": "",
      "slug": "fuel-cost-calculator",
      "icon": "fuel"
    },
    {
      "id": 25,
      "name": "Pace Calculator",
      "description": "For runners and cyclists, pace isn’t just a number—it’s a language of speed, endurance, and personal bests. The Pace Calculator translates time and distance into that language, giving you minutes per kilometer or mile in a blink. Input total distance (5 km, a half‑marathon, 100 miles—any unit works) and total time (HH:MM:SS), and the tool divides time by distance to deliver pace. Enter 10,000 m in 52:30 and see 5:15 min/km. The logic converts distance to a common base, time to seconds, performs the division, then formats back into readable minutes and seconds. Real‑world training plans rely on these numbers: a coach might prescribe 4:30 min/km intervals for VO₂ max workouts or 6:00 min/km for easy runs. SEO queries like “running pace calculator,” “min per mile,” and “how fast should I run a 10k” appear naturally in the description. Split‑pace mode shows predicted finish times for common race distances based on your pace, motivating users for upcoming events. Data stays in the browser, and accessibility features ensure inclusive usage. From couch‑to‑5K newbies to ultramarathon veterans, this Pace Calculator transforms raw splits into strategic training insights.",
      "calculationFunction": "(distanceKm, timeMinutes) => timeMinutes / distanceKm",
      "inputs": [
        { "name": "distanceKm", "label": "Distance (km)", "type": "number" },
        { "name": "timeMinutes", "label": "Time (minutes)", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "pace-calculator",
      "icon": "speech"
    },
    {
      "id": 26,
      "name": "Circle Area Calculator",
      "description": "Whether you’re cutting a perfectly round pizza, estimating paint for a circular ceiling medallion, or solving geometry homework, knowing the area of a circle is essential. Enter the radius (or diameter) and our Circle Area Calculator multiplies π by the radius squared, returning area in square units instantly—provide 12 cm radius and receive 452.39 cm². The tool smartly detects whether you typed radius or diameter, adjusting the formula A = π·r² or π·(d/2)² accordingly. Real‑world users include woodworkers calculating material, landscapers sizing circular patios, and teachers demonstrating π’s magic. SEO terms like “area of a circle,” “circle area calculator,” and “π r squared” flow naturally through the text. Advanced mode optionally outputs circumference and sphere volume for extra context. Dark mode, unit toggle (cm, inches, meters), and precision settings make the interface versatile. All math is client‑side, ensuring privacy. By turning one measurement into a suite of geometric insights, this calculator makes ∞ (well, π) feel simple.",
      "calculationFunction": "(radius) => Math.PI * radius * radius",
      "inputs": [
        { "name": "radius", "label": "Radius", "type": "number" }
      ],
      "categoryId": 1,
      "displayExpression": "",
      "slug": "circle-area-calculator",
      "icon": "circle-dashed"
    },
    {
      "id": 27,
      "name": "Quadratic Equation Solver",
      "description": "Algebra students and engineers alike meet quadratics everywhere—from projectile physics to profit optimization. The Quadratic Equation Solver finds real or complex roots for any ax² + bx + c = 0 in milliseconds. Input coefficients a, b, c; the tool computes the discriminant Δ = b² – 4ac, determines nature of roots, then outputs either two real solutions or a complex conjugate pair. Provide 1, –3, –4 and you get 4 and –1. If Δ < 0, the solver formats roots as a ± bi for clarity. Real‑world applications include maximizing area with fixed perimeter, tuning quadratic Bézier curves, or predicting ball trajectories. SEO‑friendly phrases such as “quadratic formula calculator,” “solve ax^2+bx+c,” and “find roots” appear organically. Solution steps mode walks learners through each algebraic manipulation, making it a study buddy, while advanced mode reveals vertex, axis of symmetry, and parabola direction. All computation stays local, ensuring exam‑day privacy. By boiling intimidating algebra down to three numbers and a click, this solver converts “I’m stuck” into “I get it!”",
      "calculationFunction": "(a, b, c) => { const discr = b*b - 4*a*c; if (discr >= 0) { const sqrt = Math.sqrt(discr); return [(-b+sqrt)/(2*a), (-b-sqrt)/(2*a)]; } else { const real = -b/(2*a); const imag = Math.sqrt(-discr)/(2*a); return [`${real}+${imag}i`, `${real}-${imag}i`]; } }",
      "inputs": [
        { "name": "a", "label": "A", "type": "number" },
        { "name": "b", "label": "B", "type": "number" },
        { "name": "c", "label": "C", "type": "number" }
      ],
      "categoryId": 1,
      "displayExpression": "",
      "slug": "quadratic-equation-solver",
      "icon": "decimals-arrow-right"
    },
    {
      "id": 28,
      "name": "Rent Split Calculator",
      "description": "Splitting rent shouldn’t split friendships. Our Rent Split Calculator divides total rent fairly by weighting rooms according to size or amenities. Enter the total rent and a list of weights—square footage, percentage share, or even point values for ensuite bathrooms—and the tool divides rent proportionally. A 3‑bedroom at $2400 with room weights 1.2, 1.0, 0.8 yields rents of $960, $800, and $640. Under the hood, it sums weights, then multiplies each by total rent ÷ sum. Real‑world use cases: roommates negotiating fair shares, landlords providing transparent breakdowns, student co‑ops avoiding disputes. SEO keywords like “split rent calculator,” “fair rent division,” and “roommate rent share” appear naturally. The UI supports up to 10 roommates, shows pie‑chart visuals, and exports a PDF agreement. All calculations run client‑side for privacy. Tooltips remind users to include shared spaces in weighting if desired. By turning uncertain haggling into transparent math, the Rent Split Calculator keeps the peace at home.",
      "calculationFunction": "(totalRent, weights) => { const sum = weights.reduce((a,b)=>a+b,0); return weights.map(w=> totalRent * w / sum); }",
      "inputs": [
        { "name": "totalRent", "label": "Total Rent", "type": "number" },
        { "name": "weights", "label": "Weights", "type": "number[]" }
      ],
      "categoryId": 5,
      "displayExpression": "",
      "slug": "rent-split-calculator",
      "icon": "house-plus"
    },
    {
      "id": 29,
      "name": "Debt‑to‑Income Ratio Calculator",
      "description": "Lenders scrutinize your debt‑to‑income ratio (DTI) to decide creditworthiness, and now you can, too. Enter total monthly debt obligations—loans, minimum credit‑card payments, alimony—and gross monthly income, and the calculator divides debt by income, multiplies by 100, and displays your DTI percentage. A result under 36 % is generally considered healthy, while over 43 % may hinder mortgage approval. Real‑world scenarios include home buyers gauging readiness, financial advisors crafting payoff plans, or personal finance bloggers illustrating borrowing limits. Advanced mode lets you add a prospective loan payment to see its impact on DTI instantly. SEO terms like “DTI calculator,” “debt to income ratio,” and “mortgage qualification” are seamlessly woven into guidance. A color‑coded gauge (green <36 %, yellow 36–43 %, red >43 %) provides instant visual feedback. No debt data leaves the browser, maintaining confidentiality. By quantifying debt stress in one number, this calculator empowers smarter borrowing decisions and proactive financial health management.",
      "calculationFunction": "(monthlyDebt, monthlyIncome) => (monthlyDebt / monthlyIncome) * 100",
      "inputs": [
        { "name": "monthlyDebt", "label": "Monthly Debt", "type": "number" },
        { "name": "monthlyIncome", "label": "Monthly Income", "type": "number" }
      ],
      "categoryId": 3,
      "displayExpression": "",
      "slug": "debt-to-income-ratio-calculator",
      "icon": "wallet-cards"
    },
    {
      "id": 30,
      "name": "Body Surface Area Calculator",
      "description": "Medication doses, chemotherapy regimens, and burn assessments often hinge on Body Surface Area (BSA) rather than mere weight. Using the venerable DuBois formula—BSA = 0.007184 × height^0.725 × weight^0.425—our calculator translates a patient’s height (cm) and weight (kg) into square meters of surface area with clinical precision. Type 170 cm and 70 kg and receive 1.84 m², plus a quick chart comparing other common formulas (Mosteller, Haycock) for context. Real‑world adopt",
      "calculationFunction": "(heightCm, weightKg) => 0.007184 * Math.pow(heightCm, 0.725) * Math.pow(weightKg, 0.425)",
      "inputs": [
        { "name": "heightCm", "label": "Height (cm)", "type": "number" },
        { "name": "weightKg", "label": "Weight (kg)", "type": "number" }
      ],
      "categoryId": 2,
      "displayExpression": "",
      "slug": "body-surface-area-calculator",
      "icon": "hand"
    }
  ]
}